Ran Plan for project: `search-recommand-devops-apnortheast2-stg` dir: `env/stg/apne2/devops` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.elb.aws_lb_listener.alb_listener["search-alb-http-listener"] will be created
+ resource "aws_lb_listener" "alb_listener" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = "arn:aws:elasticloadbalancing:ap-northeast-2:842675972665:loadbalancer/app/search-recommand-alb-stg/66f2ee5c9231566f"
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags                                                                  = {
          + "Name"      = "search-alb-http-listener-stg"
          + "createdBy" = "devops@example.com"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tags_all                                                              = {
          + "Name"      = "search-alb-http-listener-stg"
          + "createdBy" = "devops@example.com"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Fixed response content"
              + status_code  = "200"
            }
        }

      + mutual_authentication (known after apply)
    }

  # module.elb.aws_lb_listener_rule.alb_listener_rule["search-elasticsearch-alb-http-listener-rule"] will be created
+ resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 2
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/elasticsearch",
                ]
            }
        }
    }

  # module.elb.aws_lb_listener_rule.alb_listener_rule["search-opensearch-alb-http-listener-rule"] will be created
+ resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 1
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/vector",
                ]
            }
        }
    }

  # module.elb.aws_lb_target_group.target_group["search-elasticsearch-alb-tg"] will be created
+ resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "search-elasticsearch-alb-tg-stg"
      + name_prefix                        = (known after apply)
      + port                               = 10092
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"      = "search-elasticsearch-alb-tg-stg"
          + "createdBy" = "devops@example.com"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tags_all                           = {
          + "Name"      = "search-elasticsearch-alb-tg-stg"
          + "createdBy" = "devops@example.com"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0172c1ef29d967d43"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health-check"
          + port                = "10092"
          + protocol            = "HTTP"
          + timeout             = 15
          + unhealthy_threshold = 5
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.elb.aws_lb_target_group.target_group["search-opensearch-alb-tg"] will be created
+ resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "search-opensearch-alb-tg-stg"
      + name_prefix                        = (known after apply)
      + port                               = 10091
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"      = "search-opensearch-alb-tg-stg"
          + "createdBy" = "devops@example.com"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + tags_all                           = {
          + "Name"      = "search-opensearch-alb-tg-stg"
          + "createdBy" = "devops@example.com"
          + "env"       = "stg"
          + "managedBy" = "terraform-admin"
          + "project"   = "search-recommand"
          + "service"   = "search-recommand"
          + "teamTag"   = "devops"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0172c1ef29d967d43"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health-check"
          + port                = "10091"
          + protocol            = "HTTP"
          + timeout             = 15
          + unhealthy_threshold = 5
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ debug_ecs_module     = (sensitive value)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p search-recommand-devops-apnortheast2-stg
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://c70ccddf8256:4141/lock?id=DevOpsTechGroup%252Fsearch-recommand-terraform%252Fenv%252Fstg%252Fapne2%252Fdevops%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p search-recommand-devops-apnortheast2-stg
  ```
Plan: 5 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```